RIOT-OS/RIOT/cpu/lpc2387/mci/lpc2387-mci.c
    //for (Timer[0] = 10; Timer[0]; ) ; /* 10ms */
    xtimer_usleep(1000);

    MCI_POWER = 0x03;                   /* Enable signals */
}


static void power_off(void)
{
    MCI_MASK0 = 0;
    MCI_COMMAND = 0;
    MCI_DATA_CTRL = 0;

    MCI_POWER = 0;          /* Power-off */
    MCI_CLOCK = 0;

    // pin 0.21 low inactive
    SCS &= ~0x08;

    //0.21 MCI led Pin (turns sd card off, too)
    //0.19 0.20 0.21 0.22 with pull-down
    PINMODE1 |= (BIT6 | BIT7) | (BIT8 | BIT9) | (BIT10 | BIT11) | (BIT12 | BIT13);
    PINSEL1 &= ~((BIT6 | BIT7) | (BIT8 | BIT9) | (BIT10 | BIT11) | (BIT12 | BIT13));
    //  Pins should be now configured as standard input (see board_init.c if you accidentally reconfigured them)

    //2.11 2.12 2.13 with pull-down
    PINMODE4 |= (BIT22 | BIT23) | (BIT24 | BIT25) | (BIT26 | BIT27);
    PINSEL4 &= ~((BIT22 | BIT23) | (BIT24 | BIT25) | (BIT26 | BIT27));
    //  Pins should be now configured as standard input (see board_init.c if you accidentally reconfigured them)

    Stat |= STA_NOINIT;
}


/*-----------------------------------------------------------------------*/
/* Send a command packet to the card and receive a response              */
/*-----------------------------------------------------------------------*/

/*
 * @param idx       Command index (bit[5..0]), ACMD flag (bit7)
 * @param arg       Command argument
 * @param rt        Expected response type. None(0), Short(1) or Long(2)
 * @param *buff     Response return buffer
 * @return 1 when function succeeded otherwise returns 0
 * */
static int send_cmd(unsigned int idx, unsigned long arg, unsigned int rt, unsigned long *buff)
{
    unsigned int s, mc;

    if (idx & 0x80) {               /* Send a CMD55 prior to the specified command if it is ACMD class */
        if (!send_cmd(CMD55, (unsigned long)CardRCA << 16, 1, buff) /* When CMD55 is faild, */
           || !(buff[0] & 0x00000020)) {
            return 0;    /* exit with error */
        }
    }

    idx &= 0x3F;                    /* Mask out ACMD flag */

    do {                            /* Wait while CmdActive bit is set */
        MCI_COMMAND = 0;            /* Cancel to transmit command */
        MCI_CLEAR = 0x0C5;          /* Clear status flags */

        for (s = 0; s < 10; s++) {
            MCI_STATUS;    /* Skip lock out time of command reg. */
        }
    }
    while (MCI_STATUS & 0x00800);

    MCI_ARGUMENT = arg;             /* Set the argument into argument register */
    mc = 0x400 | idx;               /* Enable bit + index */

    if (rt == 1) {
        mc |= 0x040;    /* Set Response bit to reveice short resp */
    }

    if (rt > 1) {
        mc |= 0x0C0;    /* Set Response and LongResp bit to receive long resp */
    }

    MCI_COMMAND = mc;               /* Initiate command transaction */

    //Timer[1] = 100;
    uint32_t timerstart = xtimer_now();

    while (1) {                     /* Wait for end of the cmd/resp transaction */

        //if (!Timer[1]) return 0;
        if (xtimer_now() - timerstart > 10000) {
            return 0;
        }

        s = MCI_STATUS;             /* Get the transaction status */

        if (rt == 0) {
            if (s & 0x080) {
                return 1;    /* CmdSent */
            }
        }
        else {
            if (s & 0x040) {
                break;    /* CmdRespEnd */
            }

            if (s & 0x001) {
                /* CmdCrcFail */
                if (idx == 1 || idx == 12 || idx == 41) { /* Ignore CRC error on CMD1/12/41 */
                    break;
                }

                return 0;
            }

            if (s & 0x004) {
                return 0;    /* CmdTimeOut */
            }
        }
    }

    buff[0] = MCI_RESP0;            /* Read the response words */

    if (rt == 2) {
        buff[1] = MCI_RESP1;
        buff[2] = MCI_RESP2;
        buff[3] = MCI_RESP3;
    }

    return 1;       /* Return with success */
}




/*-----------------------------------------------------------------------*/
/* Wait card ready                                                       */
/*-----------------------------------------------------------------------*/

/**
 * @param tmr   Timeout in unit of 1ms
 * @returns 1 when card is tran state, otherwise returns 0
 */
static int wait_ready(unsigned short tmr)
{
    unsigned long rc;

    uint32_t stoppoll = xtimer_now() + tmr * 100;
    bool bBreak = false;

    while (xtimer_now() < stoppoll/*Timer[0]*/) {
        if (send_cmd(CMD13, (unsigned long) CardRCA << 16, 1, &rc) && ((rc & 0x01E00) == 0x00800)) {
            bBreak = true;
            break;
        }

        /* This loop will take a time. Insert rot_rdq() here for multitask envilonment. */
    }

    return bBreak;//Timer[0] ? 1 : 0;
}




/*-----------------------------------------------------------------------*/
/* Swap byte order                                                       */
/*-----------------------------------------------------------------------*/
static void bswap_cp(unsigned char *dst, const unsigned long *src)
{
    unsigned long d;


    d = *src;
    *dst++ = (unsigned char)(d >> 24);
    *dst++ = (unsigned char)(d >> 16);
    *dst++ = (unsigned char)(d >> 8);
    *dst++ = (unsigned char)(d >> 0);
}




/*--------------------------------------------------------------------------

   Public Functions

---------------------------------------------------------------------------*/


/*-----------------------------------------------------------------------*/
/* Initialize Disk Drive                                                 */
/*-----------------------------------------------------------------------*/
DSTATUS MCI_initialize(void)
{
    unsigned int cmd, n;
    unsigned long resp[4];
    unsigned char ty;

    if (Stat & STA_NODISK) {
        return Stat;    /* No card in the socket */
    }

    power_off();

    xtimer_usleep(1000);

    power_on();                             /* Force socket power on */
    MCI_CLOCK = 0x100 | (PCLK / MCLK_ID / 2 - 1);   /* Set MCICLK = MCLK_ID */
    //for (Timer[0] = 2; Timer[0]; );
    xtimer_usleep(250);

