RIOT-OS/RIOT/cpu/lpc2387/mci/lpc2387-mci.c
    send_cmd(CMD0, 0, 0, NULL);             /* Enter idle state */
    CardRCA = 0;

    /*---- Card is 'idle' state ----*/

    /* Initialization timeout of 1000 msec */
    uint32_t start = xtimer_now();

    /* SDC Ver2 */
    if (send_cmd(CMD8, 0x1AA, 1, resp) && (resp[0] & 0xFFF) == 0x1AA) {
        /* The card can work at vdd range of 2.7-3.6V */
        DEBUG("SDC Ver. 2\n");

        do {
            /* Wait while card is busy state (use ACMD41 with HCS bit) */
            /* This loop will take a time. Insert wai_tsk(1) here for multitask envilonment. */
            if (xtimer_now() > start + 1000000/* !Timer[0] */) {
                DEBUG("%s, %d: Timeout #1\n", RIOT_FILE_RELATIVE, __LINE__);
                goto di_fail;
            }
        }
        while (!send_cmd(ACMD41, 0x40FF8000, 1, resp) || !(resp[0] & 0x80000000));

        ty = (resp[0] & 0x40000000) ? CT_SD2 | CT_BLOCK : CT_SD2;   /* Check CCS bit in the OCR */
    }
    else {                                  /* SDC Ver1 or MMC */
        if (send_cmd(ACMD41, 0x00FF8000, 1, resp)) {
            DEBUG("SDC Ver. 1\n");
            ty = CT_SD1;
            cmd = ACMD41;           /* ACMD41 is accepted -> SDC Ver1 */
        }
        else {
            DEBUG("MMC\n");
            ty = CT_MMC;
            cmd = CMD1;         /* ACMD41 is rejected -> MMC */
        }

        do {
            /* Wait while card is busy state (use ACMD41 or CMD1) */
            DEBUG("%s, %d: %lX\n", RIOT_FILE_RELATIVE, __LINE__, resp[0]);

            /* This loop will take a time. Insert wai_tsk(1) here for multitask envilonment. */
            if (xtimer_now() > start + 1000000/* !Timer[0] */) {
                DEBUG("now: %lu, started at: %lu\n", xtimer_now(), start);
                DEBUG("%s, %d: Timeout #2\n", RIOT_FILE_RELATIVE, __LINE__);
                goto di_fail;
            }
        }
        while (!send_cmd(cmd, 0x00FF8000, 1, resp) || !(resp[0] & 0x80000000));
    }

    CardType = ty;                          /* Save card type */
    bswap_cp(&CardInfo[32], resp);          /* Save OCR */

    /*---- Card is 'ready' state ----*/

    if (!send_cmd(CMD2, 0, 2, resp)) {
        DEBUG("%s, %d: Failed entering ident state", RIOT_FILE_RELATIVE,
              __LINE__);
        goto di_fail;   /* Enter ident state */
    }

    for (n = 0; n < 4; n++) {
        bswap_cp(&CardInfo[n * 4 + 16], &resp[n]);    /* Save CID */
    }

    /*---- Card is 'ident' state ----*/

    if (ty & CT_SDC) {                      /* SDC: Get generated RCA and save it */
        if (!send_cmd(CMD3, 0, 1, resp)) {
            DEBUG("%s, %d: Failed generating RCA\n", RIOT_FILE_RELATIVE, __LINE__);
            goto di_fail;
        }

        CardRCA = (unsigned short)(resp[0] >> 16);
    }
    else {                              /* MMC: Assign RCA to the card */
        if (!send_cmd(CMD3, 1 << 16, 1, resp)) {
            goto di_fail;
        }

        CardRCA = 1;
    }

    /*---- Card is 'stby' state ----*/

    if (!send_cmd(CMD9, (unsigned long)CardRCA << 16, 2, resp)) {   /* Get CSD and save it */
        goto di_fail;
    }

    for (n = 0; n < 4; n++) {
        bswap_cp(&CardInfo[n * 4], &resp[n]);
    }

    if (!send_cmd(CMD7, (unsigned long)CardRCA << 16, 1, resp)) {   /* Select card */
        //printf("MCI CMD7 fail\n");
        goto di_fail;
    }

    /*---- Card is 'tran' state ----*/

    if (!(ty & CT_BLOCK)) {     /* Set data block length to 512 (for byte addressing cards) */
        if (!send_cmd(CMD16, 512, 1, resp) || (resp[0] & 0xFDF90000)) {
            //printf("MCI CMD16 fail\n");
            goto di_fail;
        }
    }

#if USE_4BIT

    if (ty & CT_SDC) {      /* Set wide bus mode (for SDCs) */
        if (!send_cmd(ACMD6, 2, 1, resp)    /* Set bus mode of SDC */
           || (resp[0] & 0xFDF90000)) {
            //printf("MCI ACMD6 fail\n");
            goto di_fail;
        }

        MCI_CLOCK |= 0x800;                 /* Set bus mode of MCI */
    }

#endif

    MCI_CLOCK = (MCI_CLOCK & 0xF00) | 0x200 | (PCLK / MCLK_RW / 2 - 1);     /* Set MCICLK = MCLK_RW, power-save mode */

    Stat &= ~STA_NOINIT;    /* Clear STA_NOINIT */
    return Stat;

di_fail:
    power_off();
    Stat |= STA_NOINIT;     /* Set STA_NOINIT */
    return Stat;
}




/*-----------------------------------------------------------------------*/
/* Get Disk Status                                                       */
/*-----------------------------------------------------------------------*/

DSTATUS MCI_status(void)
{
    return Stat;
}




/*-----------------------------------------------------------------------*/
/* Read Sector(s)                                                        */
/*-----------------------------------------------------------------------*/

/**
 * @param buff      Pointer to the data buffer to store read data
 * @param sector    Start sector number (LBA)
 * @param count     Sector count (1..127)
 */
DRESULT MCI_read(unsigned char *buff, unsigned long sector, unsigned char count)
{
    unsigned long resp;
    unsigned int cmd;

    if (count < 1 || count > 127) {
        return RES_PARERR;    /* Check parameter */
    }

    if (Stat & STA_NOINIT) {
        return RES_NOTRDY;    /* Check drive status */
    }

    if (!(CardType & CT_BLOCK)) {
        sector *= 512;    /* Convert LBA to byte address if needed */
    }

    if (!wait_ready(500)) {
        return RES_ERROR;    /* Make sure that card is tran state */
    }

    ready_reception(count, 512);            /* Ready to receive data blocks */

    cmd = (count > 1) ? CMD18 : CMD17;      /* Transfer type: Single block or Multiple block */

    if (send_cmd(cmd, sector, 1, &resp)     /* Start to read */
       && !(resp & 0xC0580000)) {
        unsigned char rp = 0;

        do {
            while ((rp == XferWp) && !(XferStat & 0xC)) {
                /* Wait for block arrival */
                /* This loop will take a time. Replace it with sync process for multitask envilonment. */
            }

            if (XferStat & 0xC) {
                break; /* Abort if any error has occured */
            }

            Copy_al2un(buff, DmaBuff[rp], 512); /* Pop an block */

            XferRp = rp = (rp + 1) % N_BUF; /* Next DMA buffer */

            if (XferStat & 0xC) {
                break; /* Abort if overrun has occured */
            }

            buff += 512; /* Next user buffer address */
        } while (--count);

        if (cmd == CMD18) { /* Terminate to read (MB) */
            send_cmd(CMD12, 0, 1, &resp);
        }
    }

    stop_transfer(); /* Close data path */

    return count ? RES_ERROR : RES_OK;
}


/*-----------------------------------------------------------------------*/
/* Write Sector(s)                                                       */
/*-----------------------------------------------------------------------*/

#if _READONLY == 0

/**
 * @param buff     Pointer to the data to be written
 * @param sector   Start sector number (LBA)
 * @param count    Sector count (1..127)
 * */
DRESULT MCI_write(const unsigned char *buff, unsigned long sector, unsigned char count)
{
    unsigned long rc;
    unsigned int cmd;
    unsigned char wp, xc;

