RIOT-OS/RIOT/cpu/lpc2387/mci/lpc2387-mci.c
    if (count < 1 || count > 127) {
        return RES_PARERR;    /* Check parameter */
    }

    if (Stat & STA_NOINIT) {
        return RES_NOTRDY;    /* Check drive status */
    }

    if (Stat & STA_PROTECT) {
        return RES_WRPRT;    /* Check write protection */
    }

    if (!(CardType & CT_BLOCK)) {
        sector *= 512;    /* Convert LBA to byte address if needed */
    }

    if (!wait_ready(500)) {
        return RES_ERROR;    /* Make sure that card is tran state */
    }

    if (count == 1) {   /* Single block write */
        cmd = CMD24;
    }
    else {          /* Multiple block write */
        cmd = (CardType & CT_SDC) ? ACMD23 : CMD23;

        if (!send_cmd(cmd, count, 1, &rc)       /* Preset number of blocks to write */
           || (rc & 0xC0580000)) {
            return RES_ERROR;
        }

        cmd = CMD25;
    }

    if (!send_cmd(cmd, sector, 1, &rc)          /* Send a write command */
       || (rc & 0xC0580000)) {
        return RES_ERROR;
    }

    wp = 0;
    xc = count;

    do {                                        /* Fill block FIFO */
        Copy_un2al(DmaBuff[wp], (unsigned char *)(unsigned int)buff, 512);  /* Push a block */
        wp++;                                       /* Next DMA buffer */
        count--;
        buff += 512;                        /* Next user buffer address */
    }
    while (count && wp < N_BUF);

    XferWp = wp = wp % N_BUF;
    start_transmission(xc);                     /* Start transmission */

    while (count) {
        while ((wp == XferRp) && !(XferStat & 0xC)) {   /* Wait for block FIFO not full */
            /* This loop will take a time. Replace it with sync process for multitask envilonment. */
        }

        if (XferStat & 0xC) {
            break;    /* Abort if block underrun or any MCI error has occured */
        }

        Copy_un2al(DmaBuff[wp], (unsigned char *)(unsigned int)buff, 512);  /* Push a block */
        XferWp = wp = (wp + 1) % N_BUF;             /* Next DMA buffer */

        if (XferStat & 0xC) {
            break;    /* Abort if block underrun has occured */
        }

        count--;
        buff += 512;             /* Next user buffer address */
    }

    while (!(XferStat & 0xC)) {} /* Wait for all blocks sent (block underrun) */

    if (XferStat & 0x8) {
        count = 1;    /* Abort if any MCI error has occured */
    }

    stop_transfer();                            /* Close data path */

    if (cmd == CMD25 && (CardType & CT_SDC)) {  /* Terminate to write (SDC w/MB) */
        send_cmd(CMD12, 0, 1, &rc);
    }

    return count ? RES_ERROR : RES_OK;
}
#endif /* _READONLY */




/*-----------------------------------------------------------------------*/
/* Miscellaneous Functions                                               */
/*-----------------------------------------------------------------------*/

DRESULT MCI_ioctl(
    unsigned char ctrl,     /* Control code */
    void *buff      /* Buffer to send/receive data block */
)
{
    DRESULT res;
    unsigned char *ptr = (unsigned char *)buff;
    unsigned long resp[4], d, *dp, st, ed;


    if (Stat & STA_NOINIT) {
        return RES_NOTRDY;
    }

    res = RES_ERROR;

    switch(ctrl) {
        case CTRL_SYNC :    /* Make sure that all data has been written on the media */
            if (wait_ready(500)) {  /* Wait for card enters tarn state */
                res = RES_OK;
            }

            break;

        case GET_SECTOR_COUNT : /* Get number of sectors on the disk (unsigned long) */
            if ((CardInfo[0] >> 6) == 1) {  /* SDC CSD v2.0 */
                d = ((unsigned short)CardInfo[8] << 8) + CardInfo[9] + 1;
                *(unsigned long *)buff = d << 10;
            }
            else {                      /* MMC or SDC CSD v1.0 */
                unsigned char b = (CardInfo[5] & 15) + ((CardInfo[10] & 128) >> 7) + ((CardInfo[9] & 3) << 1) + 2;
                d = (CardInfo[8] >> 6) + ((unsigned short)CardInfo[7] << 2) + ((unsigned short)(CardInfo[6] & 3) << 10) + 1;
                *(unsigned long *)buff = d << (b - 9);
            }

            res = RES_OK;
            break;

        case GET_SECTOR_SIZE :  /* Get sectors on the disk (unsigned short) */
            *(unsigned short *)buff = 512;
            res = RES_OK;
            break;

        case GET_BLOCK_SIZE :   /* Get erase block size in unit of sectors (unsigned long) */
            if (CardType & CT_SD2) {    /* SDC ver 2.00 */
                *(unsigned long *)buff = 16UL << (CardInfo[10] >> 4);
            }
            else {                  /* SDC ver 1.XX or MMC */
                if (CardType & CT_SD1) {    /* SDC v1 */
                    *(unsigned long *)buff = (((CardInfo[10] & 63) << 1) + ((unsigned short)(CardInfo[11] & 128) >> 7) + 1) << ((CardInfo[13] >> 6) - 1);
                }
                else {              /* MMC */
                    *(unsigned long *)buff = ((unsigned short)((CardInfo[10] & 124) >> 2) + 1) * (((CardInfo[11] & 3) << 3) + ((CardInfo[11] & 224) >> 5) + 1);
                }
            }

            res = RES_OK;
            break;

        case CTRL_ERASE_SECTOR :    /* Erase a block of sectors */
            if (!(CardType & CT_SDC) || (!(CardInfo[0] >> 6) && !(CardInfo[10] & 0x40))) {
                break;    /* Check if sector erase can be applied to the card */
            }

            dp = (unsigned long *)buff;
            st = dp[0];
            ed = dp[1];

            if (!(CardType & CT_BLOCK)) {
                st *= 512;
                ed *= 512;
            }

            if (send_cmd(CMD32, st, 1, resp) && send_cmd(CMD33, ed, 1, resp) && send_cmd(CMD38, 0, 1, resp) && wait_ready(30000)) {
                res = RES_OK;
            }

            break;

        case CTRL_POWER :
            switch(ptr[0]) {
                case 0:     /* Sub control code == 0 (POWER_OFF) */
                    power_off();        /* Power off */
                    res = RES_OK;
                    break;

                case 1:     /* Sub control code == 1 (POWER_GET) */
                    ptr[1] = (unsigned char)power_status();
                    res = RES_OK;
                    break;

                default :
                    res = RES_PARERR;
            }

            break;

        case MMC_GET_TYPE :     /* Get card type flags (1 byte) */
            *ptr = CardType;
            res = RES_OK;
            break;

        case MMC_GET_CSD :      /* Get CSD (16 bytes) */
            memcpy(buff, &CardInfo[0], 16);
            res = RES_OK;
            break;

        case MMC_GET_CID :      /* Get CID (16 bytes) */
            memcpy(buff, &CardInfo[16], 16);
            res = RES_OK;
            break;

        case MMC_GET_OCR :      /* Get OCR (4 bytes) */
            memcpy(buff, &CardInfo[32], 4);
            res = RES_OK;
            break;

        case MMC_GET_SDSTAT :   /* Receive SD status as a data block (64 bytes) */
            if (CardType & CT_SDC) {    /* SDC */
                if (wait_ready(500)) {
                    ready_reception(1, 64);             /* Ready to receive data blocks */

                    if (send_cmd(ACMD13, 0, 1, resp)    /* Start to read */
                       && !(resp[0] & 0xC0580000)) {
                        while ((XferWp == 0) && !(XferStat & 0xC)) {}

                        if (!(XferStat & 0xC)) {
                            Copy_al2un((unsigned char *)buff, DmaBuff[0], 64);
                            res = RES_OK;
                        }
                    }
                }

                stop_transfer();                    /* Close data path */
            }

            break;

        default:
            res = RES_PARERR;
    }

    return res;
}
